/* Вводится один символ, измените его регистр. То есть, если была введена строчная буква - сделайте ее заглавной и наоборот. Символы,
не являющиеся латинской буквой, нужно выводить без изменений.

Входные данные

Вводится единственый символ.

Выходные данные

Выведите ответ на задачу.*/

#include <iostream>

using namespace std;

int main() {
    char c;

    cin >> c;

    if (isalpha(c)) {
        if (islower(c)) {
            c = toupper(c);
        }
        else {
            c = tolower(c);
        }
    }

    cout << c;

    return 0;
}
