/*Разность времен

Даны значения двух моментов времени, принадлежащих одним и тем же суткам: часы, минуты и секунды для каждого из моментов времени.
Известно, что второй момент времени наступил не раньше первого. Определите, сколько секунд прошло между двумя моментами времени.

Формат входных данных

Программа на вход получает три целых числа: часы, минуты, секунды, задающие первый момент времени и три целых числа, задающих второй момент времени.

Формат выходных данных

Выведите число секунд между этими моментами времени.*/

#include <iostream>
using namespace std;

int main()
{
    int h1, h2, min1, min2, sec1, sec2;
    cin >> h1 >> min1 >> sec1;
    cin >> h2 >> min2 >> sec2;
    cout << ((h2 * 3600) + (min2 * 60) + sec2) - ((h1 * 3600)+ (min1 * 60) +sec1) << endl;
    return 0;
}
