/*Следующее четное

На вход дается натуральное число N. Выведите следующее за ним четное число

Формат входных данных

На вход дается целое положительное число N, не превышающее 10000.

Формат выходных данных

Выведите одно целое число - ответ на задачу.*/

#include <iostream>
using namespace std;

int main()
{
	int n;
	cin >> n;
	if (n % 2 == 0)
	{
		cout << n + 2 << endl;
	}
	else
	{
		cout << n + 1 << endl;
	}

	
	

	return 0;
}
