/*Сумма цифр трехзначного числа

Дано целое трехзначное число. Найдите сумму его цифр.

Формат входных данных

На вход дается число от 100 до 999.

Формат выходных данных

Выведите одно целое число - ответ на задачу.*/

#include <iostream>
using namespace std;

int main()
{
	int n,a,b,c;
	cin >> n;
	a = n % 10;
	b = (n / 10) % 10;
	c = (n / 100) % 10;
	cout << a+b+c << endl;
	

	return 0;
}
