/*Последовательность состоит из натуральных чисел и завершается числом 0. Определите, какое количество элементов этой последовательности, равны ее наибольшему элементу.

Формат входных данных
Вводится непустая последовательность целых чисел, оканчивающаяся числом 0 (само число 0 в последовательность не входит, а служит как признак ее окончания).
Формат выходных данных
Выведите ответ на задачу.*/

#include <iostream>
using namespace std;
int main() {
    int n = 1, k = 0, max = 1;
    while (n != 0) {
        cin >> n;
        if (n > max) {
            max = n;
            k = 1;
        }
        else
            if (n == max)
                k++;
    }
    cout << k;
    return 0;
}
