/*Дана последовательность натуральных чисел, завершающаяся числом 0. Определите, какое наибольшее число подряд идущих элементов этой последовательности равны друг другу. Если не нашлось ни одной пары, тройки и т.д. элементов, равных друг другу, то программа должна вывести число 1.
Формат входных данных
Вводится последовательность натуральных чисел, оканчивающаяся числом 0 (само число 0 в последовательность не входит, а служит как признак ее окончания).
Формат выходных данных
Выведите ответ на задачу.*/

#include <iostream>
using namespace std;
int main() {
    int a, b;
    int max = 1;
    int i = 1;
    cin >> a;
    cin >> b;
    while (b != 0) {
        if (a == b) {
            i++;
        }
        else if (a != b) {
            if (i > max) {
                max = i;
                i = 1;
            }
            else {
                i = 1;
            }
        }
            a = b;
            cin >> b;
        
    }
        if (max > i) {
            cout << max;
        }
        else { cout << i; }
        
        return 0;
    
}
