/*Даны два целых числа. Программа должна вывести единицу, если первое число больше второго, двойку, если второе больше первого, или ноль, если они равны.

Формат входных данных
Вводятся два числа.
Формат выходных данных
Выведите ответ на задачу.*/

#include <iostream>
using namespace std;

int main()
{
    int a, b;
    cin >> a>> b;
    if (a > b){
        cout << 1 << endl;
    }
    else if (a == b) {
        cout << 0 << endl;
    }
    else
    {
        cout << 2 << endl;
    }
   
    return 0;
}
